Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_1 (Conv1D)            (None, 38, 8)             200       
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 36, 10)            250       
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 18, 10)            0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 18, 10)            0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 180)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 100)               18100     
_________________________________________________________________
dense_2 (Dense)              (None, 6)                 606       
=================================================================
Total params: 19,156
Trainable params: 19,156
Non-trainable params: 0
_________________________________________________________________

Date: 09/01/2020 16:03:50
File: convmemnet.py
Scores: [-0.04914867 -0.16916666 -0.08796152 -0.19518818 -0.04393564]
MSE: -0.109 (+/-0.062)
Dropout (if applicable): 0.500
Kernel (if applicable): 3, 3
Epochs: 100, Batch size: 356
K: 5


Using Files:
004_Stair01.json
004_Stair02.json
004_Stair03.json
004_Stair04.json
004_Stair05.json
