Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_1 (Conv1D)            (None, 36, 64)            2624      
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 34, 64)            12352     
_________________________________________________________________
dropout_1 (Dropout)          (None, 34, 64)            0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 2176)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 200)               435400    
_________________________________________________________________
dense_2 (Dense)              (None, 50)                10050     
_________________________________________________________________
dense_3 (Dense)              (None, 6)                 306       
=================================================================
Total params: 460,732
Trainable params: 460,732
Non-trainable params: 0
_________________________________________________________________

Date: 07/12/2019 13:33:57
File: convmemnet_chi.py
Scores: [-5.18753246e-04 -7.19462178e-04 -9.66747022e-05 -9.70539565e-05
 -1.31149982e-04]
MSE: -0.000 (+/-0.000)
Dropout (if applicable): 0.300
Kernel (if applicable): 5, 3
Epochs: 10, Batch size: 20
K: 5


Using Files:
003_Stand01.json
003_Stand02.json
