Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_1 (Conv1D)            (None, 11, 64)            5184      
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 2, 64)             41024     
_________________________________________________________________
dropout_1 (Dropout)          (None, 2, 64)             0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 100)               12900     
_________________________________________________________________
dense_2 (Dense)              (None, 100)               10100     
_________________________________________________________________
dense_3 (Dense)              (None, 6)                 606       
=================================================================
Total params: 69,814
Trainable params: 69,814
Non-trainable params: 0
_________________________________________________________________

Accuracy: 76.278% (+/-0.000)
Training: 24804
Test: 6201