Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_1 (Flatten)          (None, 160)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 100)               16100     
_________________________________________________________________
dense_2 (Dense)              (None, 50)                5050      
_________________________________________________________________
dense_3 (Dense)              (None, 6)                 306       
=================================================================
Total params: 21,456
Trainable params: 21,456
Non-trainable params: 0
_________________________________________________________________

Accuracy: 74.165% (+/-0.000)
Training: 24804
Test: 6201