Model: "Depthwise_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_11 (Reshape)         (None, 1, 1000, 8)        0         
_________________________________________________________________
depthwise_conv2d_22 (Depthwi (None, 1, 1000, 40)       640       
_________________________________________________________________
max_pooling2d_22 (MaxPooling (None, 1, 166, 40)        0         
_________________________________________________________________
depthwise_conv2d_23 (Depthwi (None, 1, 166, 120)       480       
_________________________________________________________________
max_pooling2d_23 (MaxPooling (None, 1, 33, 120)        0         
_________________________________________________________________
dropout_66 (Dropout)         (None, 1, 33, 120)        0         
_________________________________________________________________
flatten_11 (Flatten)         (None, 3960)              0         
_________________________________________________________________
dense_66 (Dense)             (None, 1000)              3961000   
_________________________________________________________________
dropout_67 (Dropout)         (None, 1000)              0         
_________________________________________________________________
dense_67 (Dense)             (None, 200)               200200    
_________________________________________________________________
dropout_68 (Dropout)         (None, 200)               0         
_________________________________________________________________
dense_68 (Dense)             (None, 200)               40200     
_________________________________________________________________
dropout_69 (Dropout)         (None, 200)               0         
_________________________________________________________________
dense_69 (Dense)             (None, 100)               20100     
_________________________________________________________________
dropout_70 (Dropout)         (None, 100)               0         
_________________________________________________________________
dense_70 (Dense)             (None, 50)                5050      
_________________________________________________________________
dropout_71 (Dropout)         (None, 50)                0         
_________________________________________________________________
dense_71 (Dense)             (None, 6)                 306       
=================================================================
Total params: 4,227,976
Trainable params: 4,227,976
Non-trainable params: 0
_________________________________________________________________
data_dir: C:\Users\hbkm9\Documents\Projects\CYB\Experiment1\CYB003\Data
window_size: 1000
delay: 1000
gap_windows: None
stride: 20
freq_factor: 20
file_names: ['003_UpStair01.json', '003_UpStair03.json', '003_UpStair05.json', '003_UpStair07.json', '003_UpStair09.json', '003_UpStair11.json', '003_UpStair13.json', '003_UpStair15.json', '003_UpStair17.json', '003_UpStair21.json', '003_UpStair23.json', '003_UpStair25.json', '003_UpStair27.json']
channel_mask: None
time_step: 1
preproc: <function norm_emg at 0x0000025DAE4BBEE8>
batch_size: 64
input_shape: (1000, 8)
n_outputs: 6
acts: ('relu', 'selu')
krnl: ((1, 15), (1, 3))
pad: same
dil: ((1, 1), (1, 10))
strides: ((1, 1), (1, 1))
mpool: ((1, 6), (1, 5))
depth_mul: (5, 3)
drp: 0.5
dense_drp: True
dense: (1000, 200, 200, 100, 50)
b_norm: False
loss: ([0.028206519908276884, 0.017946848056381755, 0.016525571355212494, 0.03060131571803551, 0.019340842252963363], 0.022524219458174)
coeff_determination: ([0.9733691, 0.98275775, 0.98443186, 0.97085834, 0.9816557], 0.9786146)
val_loss: ([0.034768830984830856, 0.047707101241463705, 0.0341599707181255, 0.03708259595765008, 0.017329729524337582], 0.03420964568528155)
val_coeff_determination: ([0.9664577, 0.9568036, 0.9669009, 0.9655646, 0.9833825], 0.9678219)
datagenerator: <class 'data_gen.datagenerator.TCNDataGenerator'>
