Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 100, 8)]     0                                            
__________________________________________________________________________________________________
input_1 (InputLayer)            [(None, 100, 8)]     0                                            
__________________________________________________________________________________________________
reshape (Reshape)               (None, 1, 100, 8)    0           input_2[0][0]                    
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 1, 100, 8)    0           input_1[0][0]                    
__________________________________________________________________________________________________
depthwise_conv2d (DepthwiseConv (None, 1, 86, 32)    512         reshape[0][0]                    
                                                                 reshape_1[0][0]                  
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 1, 21, 32)    0           depthwise_conv2d[0][0]           
                                                                 depthwise_conv2d[1][0]           
__________________________________________________________________________________________________
depthwise_conv2d_1 (DepthwiseCo (None, 1, 15, 128)   512         max_pooling2d[0][0]              
                                                                 max_pooling2d[1][0]              
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 1, 3, 128)    0           depthwise_conv2d_1[0][0]         
                                                                 depthwise_conv2d_1[1][0]         
__________________________________________________________________________________________________
dropout (Dropout)               (None, 1, 3, 128)    0           max_pooling2d_1[0][0]            
                                                                 max_pooling2d_1[1][0]            
__________________________________________________________________________________________________
flatten (Flatten)               (None, 384)          0           dropout[0][0]                    
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 384)          0           dropout[1][0]                    
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 768)          0           flatten[0][0]                    
                                                                 flatten_1[0][0]                  
__________________________________________________________________________________________________
dense (Dense)                   (None, 100)          76900       concatenate[0][0]                
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 50)           5050        dense[0][0]                      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 6)            306         dense_1[0][0]                    
==================================================================================================
Total params: 83,280
Trainable params: 83,280
Non-trainable params: 0
__________________________________________________________________________________________________
data_dir: C:\Users\hbkm9\Documents\Projects\CYB\Experiment_Balint\CYB004\Data
window_size: 240
gap_windows: (100, 100)
delay: 100
stride: 1
freq_factor: 20
file_names: ['004_Walk01.json', '004_Walk02.json', '004_Walk03.json', '004_Walk04.json', '004_Walk05.json', '004_Walk06.json', '004_Walk07.json', '004_Walk08.json', '004_Walk09.json', '004_Walk10.json', '004_Walk11.json', '004_Walk12.json', '004_Walk13.json', '004_Walk14.json', '004_Walk15.json', '004_Walk16.json', '004_Walk17.json', '004_Walk18.json', '004_Walk19.json']
preproc: <function bp_filter at 0x0000012A6E808AF8>
ppkwargs: {'high_band': 30, 'low_band': 400, 'sfreq': 2000, 'filt_ord': 2}
batch_size: 32
input_shapes: [(100, 8), (100, 8)]
n_outputs: 6
drp: 0.5
krnl: (15, 3)
dil: 3
mpool: (4, 4)
depth_mul: (4, 4)
dense: (100, 50)
