Model: "Depthwise_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_17 (Reshape)         (None, 1, 1000, 8)        0         
_________________________________________________________________
depthwise_conv2d_34 (Depthwi (None, 1, 1000, 40)       640       
_________________________________________________________________
max_pooling2d_34 (MaxPooling (None, 1, 166, 40)        0         
_________________________________________________________________
depthwise_conv2d_35 (Depthwi (None, 1, 166, 120)       480       
_________________________________________________________________
max_pooling2d_35 (MaxPooling (None, 1, 33, 120)        0         
_________________________________________________________________
dropout_102 (Dropout)        (None, 1, 33, 120)        0         
_________________________________________________________________
flatten_17 (Flatten)         (None, 3960)              0         
_________________________________________________________________
dense_102 (Dense)            (None, 1000)              3961000   
_________________________________________________________________
dropout_103 (Dropout)        (None, 1000)              0         
_________________________________________________________________
dense_103 (Dense)            (None, 200)               200200    
_________________________________________________________________
dropout_104 (Dropout)        (None, 200)               0         
_________________________________________________________________
dense_104 (Dense)            (None, 200)               40200     
_________________________________________________________________
dropout_105 (Dropout)        (None, 200)               0         
_________________________________________________________________
dense_105 (Dense)            (None, 100)               20100     
_________________________________________________________________
dropout_106 (Dropout)        (None, 100)               0         
_________________________________________________________________
dense_106 (Dense)            (None, 50)                5050      
_________________________________________________________________
dropout_107 (Dropout)        (None, 50)                0         
_________________________________________________________________
dense_107 (Dense)            (None, 6)                 306       
=================================================================
Total params: 4,227,976
Trainable params: 4,227,976
Non-trainable params: 0
_________________________________________________________________
data_dir: C:\Users\hbkm9\Documents\Projects\CYB\Experiment1\CYB003\Data
window_size: 1000
delay: 1000
gap_windows: None
stride: 20
freq_factor: 20
file_names: ['003_DownStair04.json', '003_DownStair06.json', '003_DownStair08.json', '003_DownStair10.json', '003_DownStair12.json', '003_DownStair14.json', '003_DownStair16.json', '003_DownStair18.json', '003_DownStair20.json', '003_DownStair22.json', '003_DownStair24.json', '003_DownStair26.json', '003_DownStair28.json']
channel_mask: None
time_step: 1
preproc: <function norm_emg at 0x0000025DAE4BBEE8>
batch_size: 64
input_shape: (1000, 8)
n_outputs: 6
acts: ('relu', 'selu')
krnl: ((1, 15), (1, 3))
pad: same
dil: ((1, 1), (1, 10))
strides: ((1, 1), (1, 1))
mpool: ((1, 6), (1, 5))
depth_mul: (5, 3)
drp: 0.5
dense_drp: True
dense: (1000, 200, 200, 100, 50)
b_norm: False
loss: ([0.016741946059708173, 0.01537922197429776, 0.015664510999832522, 0.015288928833475934, 0.015088095778349853], 0.015632540729132848)
coeff_determination: ([0.983117, 0.9845057, 0.9842318, 0.98460126, 0.9848829], 0.98426783)
val_loss: ([0.025969944536112823, 0.01744746105172313, 0.020624725706875326, 0.014523366192246185, 0.011219891848870449], 0.017957077867165584)
val_coeff_determination: ([0.9737392, 0.9824638, 0.9793783, 0.98564464, 0.98866963], 0.9819791)
datagenerator: <class 'data_gen.datagenerator.TCNDataGenerator'>
