Model: "Depthwise_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_11 (Reshape)         (None, 1, 1000, 8)        0         
_________________________________________________________________
depthwise_conv2d_22 (Depthwi (None, 1, 1000, 40)       640       
_________________________________________________________________
max_pooling2d_22 (MaxPooling (None, 1, 166, 40)        0         
_________________________________________________________________
depthwise_conv2d_23 (Depthwi (None, 1, 166, 120)       480       
_________________________________________________________________
max_pooling2d_23 (MaxPooling (None, 1, 33, 120)        0         
_________________________________________________________________
dropout_66 (Dropout)         (None, 1, 33, 120)        0         
_________________________________________________________________
flatten_11 (Flatten)         (None, 3960)              0         
_________________________________________________________________
dense_66 (Dense)             (None, 1000)              3961000   
_________________________________________________________________
dropout_67 (Dropout)         (None, 1000)              0         
_________________________________________________________________
dense_67 (Dense)             (None, 200)               200200    
_________________________________________________________________
dropout_68 (Dropout)         (None, 200)               0         
_________________________________________________________________
dense_68 (Dense)             (None, 200)               40200     
_________________________________________________________________
dropout_69 (Dropout)         (None, 200)               0         
_________________________________________________________________
dense_69 (Dense)             (None, 100)               20100     
_________________________________________________________________
dropout_70 (Dropout)         (None, 100)               0         
_________________________________________________________________
dense_70 (Dense)             (None, 50)                5050      
_________________________________________________________________
dropout_71 (Dropout)         (None, 50)                0         
_________________________________________________________________
dense_71 (Dense)             (None, 6)                 306       
=================================================================
Total params: 4,227,976
Trainable params: 4,227,976
Non-trainable params: 0
_________________________________________________________________
data_dir: C:\Users\hbkm9\Documents\Projects\CYB\Experiment1\CYB004\Data
window_size: 1000
delay: 1000
gap_windows: None
stride: 20
freq_factor: 20
file_names: ['004_DownSit01.json', '004_DownSit03.json', '004_DownSit05.json', '004_DownSit07.json', '004_DownSit09.json', '004_DownSit11.json', '004_DownSit13.json']
channel_mask: None
time_step: 1
preproc: <function norm_emg at 0x00000168D275BF78>
batch_size: 64
input_shape: (1000, 8)
n_outputs: 6
acts: ('relu', 'selu')
krnl: ((1, 15), (1, 3))
pad: same
dil: ((1, 1), (1, 10))
strides: ((1, 1), (1, 1))
mpool: ((1, 6), (1, 5))
depth_mul: (5, 3)
drp: 0.5
dense_drp: True
dense: (1000, 200, 200, 100, 50)
b_norm: False
loss: ([0.016566474222703787, 0.04541693751142297, 0.01627899711723808, 0.08521216654259225, 0.021585531568722834], 0.03701202139253599)
coeff_determination: ([0.9870983, 0.96431017, 0.98694193, 0.93206304, 0.9828425], 0.97065115)
val_loss: ([0.02266534252299203, 0.04294880032539368, 0.016119927633553743, 0.11005748311678569, 0.01382922730408609], 0.04112415618056224)
val_coeff_determination: ([0.9820825, 0.96445143, 0.98755723, 0.9137583, 0.9894452], 0.9674589)
datagenerator: <class 'data_gen.datagenerator.TCNDataGenerator'>
