Model: "Depthwise_model_classifier"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape (Reshape)            (None, 1, 400, 8)         0         
_________________________________________________________________
depthwise_conv2d (DepthwiseC (None, 1, 400, 40)        640       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 1, 66, 40)         0         
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (None, 1, 66, 120)        480       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 1, 13, 120)        0         
_________________________________________________________________
dropout (Dropout)            (None, 1, 13, 120)        0         
_________________________________________________________________
flatten (Flatten)            (None, 1560)              0         
_________________________________________________________________
dense (Dense)                (None, 200)               312200    
_________________________________________________________________
batch_normalization (BatchNo (None, 200)               800       
_________________________________________________________________
activation (Activation)      (None, 200)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 200)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 200)               40200     
_________________________________________________________________
batch_normalization_1 (Batch (None, 200)               800       
_________________________________________________________________
activation_1 (Activation)    (None, 200)               0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 200)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 100)               20100     
_________________________________________________________________
batch_normalization_2 (Batch (None, 100)               400       
_________________________________________________________________
activation_2 (Activation)    (None, 100)               0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 100)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 50)                5050      
_________________________________________________________________
batch_normalization_3 (Batch (None, 50)                200       
_________________________________________________________________
activation_3 (Activation)    (None, 50)                0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 50)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 3)                 153       
=================================================================
Total params: 381,023
Trainable params: 379,923
Non-trainable params: 1,100
_________________________________________________________________
data_dir: C:\Users\hbkm9\Documents\Projects\CYB\Experiment1\CYB004\Data
window_size: 400
delay: 400
gap_windows: None
stride: 1
freq_factor: 20
file_names: ['004_Sit01.json', '004_Sit02.json', '004_Sit03.json', '004_Sit04.json', '004_Sit05.json', '004_Sit06.json', '004_Sit07.json', '004_Sit08.json', '004_Sit09.json', '004_Sit10.json', '004_Sit11.json', '004_Sit12.json', '004_Stair01.json', '004_Stair02.json', '004_Stair03.json', '004_Stair04.json', '004_Stair05.json', '004_Stair06.json', '004_Stair07.json', '004_Stair08.json', '004_Stair09.json', '004_Stair10.json', '004_Stair11.json', '004_Stair12.json', '004_Stair13.json', '004_Stair14.json', '004_Stair15.json', '004_Stair16.json', '004_Stair17.json', '004_Stair18.json', '004_Stair19.json', '004_Stair20.json', '004_Stair21.json', '004_Stair22.json', '004_Stair23.json', '004_Stair24.json', '004_Stair25.json', '004_Stair26.json', '004_Stair27.json', '004_Stair28.json', '004_Stair29.json', '004_Stair30.json', '004_Stair31.json', '004_Stair32.json', '004_Stair33.json', '004_Stair34.json', '004_Stair35.json', '004_Walk01.json', '004_Walk02.json', '004_Walk03.json', '004_Walk04.json', '004_Walk05.json', '004_Walk06.json', '004_Walk07.json', '004_Walk08.json', '004_Walk09.json', '004_Walk10.json', '004_Walk11.json', '004_Walk12.json', '004_Walk13.json', '004_Walk14.json', '004_Walk15.json', '004_Walk16.json', '004_Walk17.json', '004_Walk18.json', '004_Walk19.json']
channel_mask: None
time_step: 1
preproc: <function norm_emg at 0x000001ECC9528708>
batch_size: 64
input_shape: (400, 8)
n_outputs: 3
acts: ('relu', 'selu')
krnl: ((1, 15), (1, 3))
pad: same
dil: ((1, 1), (1, 10))
strides: ((1, 1), (1, 1))
mpool: ((1, 6), (1, 5))
depth_mul: (5, 3)
drp: 0.4
dense_drp: True
dense: (200, 200, 100, 50)
b_norm: True
