Model: "Depthwise_model_classifier"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape (Reshape)            (None, 1, 400, 8)         0         
_________________________________________________________________
depthwise_conv2d (DepthwiseC (None, 1, 400, 40)        640       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 1, 66, 40)         0         
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (None, 1, 66, 120)        480       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 1, 13, 120)        0         
_________________________________________________________________
dropout (Dropout)            (None, 1, 13, 120)        0         
_________________________________________________________________
flatten (Flatten)            (None, 1560)              0         
_________________________________________________________________
dense (Dense)                (None, 500)               780500    
_________________________________________________________________
batch_normalization (BatchNo (None, 500)               2000      
_________________________________________________________________
activation (Activation)      (None, 500)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 500)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 200)               100200    
_________________________________________________________________
batch_normalization_1 (Batch (None, 200)               800       
_________________________________________________________________
activation_1 (Activation)    (None, 200)               0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 200)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 200)               40200     
_________________________________________________________________
batch_normalization_2 (Batch (None, 200)               800       
_________________________________________________________________
activation_2 (Activation)    (None, 200)               0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 200)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 100)               20100     
_________________________________________________________________
batch_normalization_3 (Batch (None, 100)               400       
_________________________________________________________________
activation_3 (Activation)    (None, 100)               0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 100)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 50)                5050      
_________________________________________________________________
batch_normalization_4 (Batch (None, 50)                200       
_________________________________________________________________
activation_4 (Activation)    (None, 50)                0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 50)                0         
_________________________________________________________________
dense_5 (Dense)              (None, 3)                 153       
=================================================================
Total params: 951,523
Trainable params: 949,423
Non-trainable params: 2,100
_________________________________________________________________
data_dir: C:\Users\hbkm9\Documents\Projects\CYB\Experiment1\CYB004\Data_p
window_size: 400
delay: 400
gap_windows: None
stride: 20
freq_factor: 20
file_names: ['004_ParamDownStair02.json', '004_ParamDownStair04.json', '004_ParamDownStair06.json', '004_ParamDownStair10.json', '004_ParamDownStair12.json', '004_ParamDownStair14.json', '004_ParamDownStair16.json', '004_ParamDownStair18.json', '004_ParamDownStair20.json', '004_ParamDownStair22.json', '004_ParamDownStair24.json', '004_ParamDownStair26.json', '004_ParamDownStair28.json', '004_ParamDownStair30.json', '004_ParamDownStair32.json', '004_ParamDownStair34.json', '004_ParamDownStair36.json', '004_ParamUpStair01.json', '004_ParamUpStair03.json', '004_ParamUpStair05.json', '004_ParamUpStair07.json', '004_ParamUpStair09.json', '004_ParamUpStair13.json', '004_ParamUpStair15.json', '004_ParamUpStair17.json', '004_ParamUpStair19.json', '004_ParamUpStair21.json', '004_ParamUpStair23.json', '004_ParamUpStair25.json', '004_ParamUpStair27.json', '004_ParamUpStair29.json', '004_ParamUpStair31.json', '004_ParamUpStair33.json', '004_ParamUpStair35.json', '004_ParamWalk01.json', '004_ParamWalk02.json', '004_ParamWalk03.json', '004_ParamWalk04.json', '004_ParamWalk05.json', '004_ParamWalk06.json', '004_ParamWalk07.json', '004_ParamWalk08.json', '004_ParamWalk09.json', '004_ParamWalk10.json', '004_ParamWalk11.json', '004_ParamWalk12.json', '004_ParamWalk13.json', '004_ParamWalk14.json', '004_ParamWalk15.json', '004_ParamWalk16.json', '004_ParamWalk17.json', '004_ParamWalk18.json', '004_ParamWalk19.json']
channel_mask: None
time_step: 1
preproc: <function norm_emg at 0x0000023505A358B8>
batch_size: 64
input_shape: (400, 8)
n_outputs: 3
acts: ('relu', 'selu')
krnl: ((1, 15), (1, 3))
pad: same
dil: ((1, 1), (1, 10))
strides: ((1, 1), (1, 1))
mpool: ((1, 6), (1, 5))
depth_mul: (5, 3)
drp: 0.4
dense_drp: True
dense: (500, 200, 200, 100, 50)
b_norm: True
