Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape (Reshape)            (None, 1, 200, 8)         0         
_________________________________________________________________
depthwise_conv2d (DepthwiseC (None, 1, 196, 48)        288       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 1, 49, 48)         0         
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (None, 1, 43, 288)        1152      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 1, 10, 288)        0         
_________________________________________________________________
dropout (Dropout)            (None, 1, 10, 288)        0         
_________________________________________________________________
flatten (Flatten)            (None, 2880)              0         
_________________________________________________________________
dense (Dense)                (None, 500)               1440500   
_________________________________________________________________
batch_normalization (BatchNo (None, 500)               2000      
_________________________________________________________________
activation (Activation)      (None, 500)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 500)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 200)               100200    
_________________________________________________________________
batch_normalization_1 (Batch (None, 200)               800       
_________________________________________________________________
activation_1 (Activation)    (None, 200)               0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 200)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 50)                10050     
_________________________________________________________________
batch_normalization_2 (Batch (None, 50)                200       
_________________________________________________________________
activation_2 (Activation)    (None, 50)                0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 50)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 6)                 306       
=================================================================
Total params: 1,555,496
Trainable params: 1,553,996
Non-trainable params: 1,500
_________________________________________________________________
data_dir: C:\Users\hbkm9\Documents\Projects\CYB\Experiment1\CYB004\Data
window_size: 200
delay: 200
gap_windows: None
stride: 1
freq_factor: 20
file_names: ['004_Walk01.json', '004_Walk02.json', '004_Walk03.json', '004_Walk04.json', '004_Walk05.json', '004_Walk06.json', '004_Walk07.json', '004_Walk08.json', '004_Walk09.json', '004_Walk10.json', '004_Walk11.json', '004_Walk12.json', '004_Walk13.json', '004_Walk14.json', '004_Walk15.json', '004_Walk16.json', '004_Walk17.json', '004_Walk18.json', '004_Walk19.json']
channel_mask: [0, 1, 2, 3, 4, 5, 6, 7]
preproc: <function norm_emg at 0x000001E270267C18>
batch_size: 64
input_shape: (200, 8)
n_outputs: 6
acts: ('relu', 'selu')
krnl: (5, 3)
pad: valid
dil: 3
mpool: (4, 4)
depth_mul: (6, 6)
drp: 0.4
dense_drp: True
dense: (500, 200, 50)
b_norm: True
