Model: "Conv2D_Model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 61, 40, 4)         3204      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 30, 20, 4)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 30, 20, 12)        444       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 15, 20, 12)        0         
_________________________________________________________________
dropout (Dropout)            (None, 15, 20, 12)        0         
_________________________________________________________________
flatten (Flatten)            (None, 3600)              0         
_________________________________________________________________
dense (Dense)                (None, 500)               1800500   
_________________________________________________________________
batch_normalization (BatchNo (None, 500)               2000      
_________________________________________________________________
activation (Activation)      (None, 500)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 500)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 200)               100200    
_________________________________________________________________
batch_normalization_1 (Batch (None, 200)               800       
_________________________________________________________________
activation_1 (Activation)    (None, 200)               0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 200)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 100)               20100     
_________________________________________________________________
batch_normalization_2 (Batch (None, 100)               400       
_________________________________________________________________
activation_2 (Activation)    (None, 100)               0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 100)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 100)               10100     
_________________________________________________________________
batch_normalization_3 (Batch (None, 100)               400       
_________________________________________________________________
activation_3 (Activation)    (None, 100)               0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 100)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 6)                 606       
=================================================================
Total params: 1,938,754
Trainable params: 1,936,954
Non-trainable params: 1,800
_________________________________________________________________
data_dir: C:\Users\hbkm9\Documents\Projects\CYB\Experiment1\CYB004\Data
window_size: 400
delay: 400
gap_windows: None
stride: 1
freq_factor: 20
file_names: ['004_Walk01.json', '004_Walk02.json', '004_Walk03.json', '004_Walk04.json', '004_Walk05.json', '004_Walk06.json', '004_Walk07.json', '004_Walk08.json', '004_Walk09.json', '004_Walk10.json', '004_Walk11.json', '004_Walk12.json', '004_Walk13.json', '004_Walk14.json', '004_Walk15.json', '004_Walk16.json', '004_Walk17.json', '004_Walk18.json', '004_Walk19.json']
channel_mask: None
time_step: 10
preproc: <function spec_proc at 0x0000023E36C93DC8>
ppkwargs: {'fbins': 500, 'gamma': 0.01, 'frange': (4, 250), 'fsamp': 2000}
batch_size: 64
input_shape: (61, 40, 8)
n_outputs: 6
acts: ('relu', 'selu')
krnl: ((10, 10), (3, 3))
pad: same
dil: ((1, 1), (1, 1))
strides: ((1, 1), (1, 1))
mpool: ((2, 2), (2, 1))
depth_mul: (4, 12)
drp: 0.5
dense_drp: True
dense: (500, 200, 100, 100)
b_norm: True
