Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape (Reshape)            (None, 1, 200, 8)         0         
_________________________________________________________________
depthwise_conv2d (DepthwiseC (None, 1, 171, 48)        1488      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 1, 42, 48)         0         
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (None, 1, 36, 192)        768       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 1, 9, 192)         0         
_________________________________________________________________
dropout (Dropout)            (None, 1, 9, 192)         0         
_________________________________________________________________
flatten (Flatten)            (None, 1728)              0         
_________________________________________________________________
dense (Dense)                (None, 100)               172900    
_________________________________________________________________
batch_normalization (BatchNo (None, 100)               400       
_________________________________________________________________
activation (Activation)      (None, 100)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 100)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 50)                5050      
_________________________________________________________________
batch_normalization_1 (Batch (None, 50)                200       
_________________________________________________________________
activation_1 (Activation)    (None, 50)                0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 50)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 6)                 306       
=================================================================
Total params: 181,112
Trainable params: 180,812
Non-trainable params: 300
_________________________________________________________________
data_dir: C:\Users\hbkm9\Documents\Projects\CYB\Experiment_Balint\CYB004\Data
window_size: 200
delay: 200
gap_windows: None
stride: 1
freq_factor: 20
file_names: ['004_Walk01.json', '004_Walk02.json', '004_Walk03.json', '004_Walk04.json', '004_Walk05.json', '004_Walk06.json', '004_Walk07.json', '004_Walk08.json', '004_Walk09.json', '004_Walk10.json', '004_Walk11.json', '004_Walk12.json', '004_Walk13.json', '004_Walk14.json', '004_Walk15.json', '004_Walk16.json', '004_Walk17.json', '004_Walk18.json', '004_Walk19.json']
preproc: <function norm_emg at 0x000002186F657A68>
ppkwargs: {'high_band': 30, 'low_band': 200, 'sfreq': 2000, 'filt_ord': 2}
batch_size: 32
input_shape: (200, 8)
n_outputs: 6
drp: 0.4
acts: ('relu', 'relu')
krnl: (30, 3)
dil: 3
mpool: (4, 4)
depth_mul: (6, 4)
dense: (100, 50)
