Model: "Depthwise_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape (Reshape)            (None, 1, 400, 8)         0         
_________________________________________________________________
depthwise_conv2d (DepthwiseC (None, 1, 400, 24)        384       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 1, 66, 24)         0         
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (None, 1, 66, 48)         192       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 1, 13, 48)         0         
_________________________________________________________________
dropout (Dropout)            (None, 1, 13, 48)         0         
_________________________________________________________________
flatten (Flatten)            (None, 624)               0         
_________________________________________________________________
dense (Dense)                (None, 500)               312500    
_________________________________________________________________
batch_normalization (BatchNo (None, 500)               2000      
_________________________________________________________________
activation (Activation)      (None, 500)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 500)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 100)               50100     
_________________________________________________________________
batch_normalization_1 (Batch (None, 100)               400       
_________________________________________________________________
activation_1 (Activation)    (None, 100)               0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 100)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 100)               10100     
_________________________________________________________________
batch_normalization_2 (Batch (None, 100)               400       
_________________________________________________________________
activation_2 (Activation)    (None, 100)               0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 100)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 20)                2020      
_________________________________________________________________
batch_normalization_3 (Batch (None, 20)                80        
_________________________________________________________________
activation_3 (Activation)    (None, 20)                0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 20)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 3)                 63        
=================================================================
Total params: 378,239
Trainable params: 376,799
Non-trainable params: 1,440
_________________________________________________________________
data_dir: C:\Users\hbkm9\Documents\Projects\CYB\Experiment1\CYB004\Data_p
window_size: 400
delay: 400
gap_windows: None
stride: 20
freq_factor: 20
file_names: ['004_ParamWalk01.json', '004_ParamWalk02.json', '004_ParamWalk03.json', '004_ParamWalk04.json', '004_ParamWalk05.json', '004_ParamWalk06.json', '004_ParamWalk07.json', '004_ParamWalk08.json', '004_ParamWalk09.json', '004_ParamWalk10.json', '004_ParamWalk11.json', '004_ParamWalk12.json', '004_ParamWalk13.json', '004_ParamWalk14.json', '004_ParamWalk15.json', '004_ParamWalk16.json', '004_ParamWalk17.json', '004_ParamWalk18.json', '004_ParamWalk19.json']
channel_mask: None
time_step: 1
preproc: <function norm_emg at 0x00000276F4B6ECA8>
angproc: <function smooth at 0x00000276F4A75E58>
batch_size: 64
input_shape: (400, 8)
n_outputs: 3
acts: ('relu', 'selu')
krnl: ((1, 15), (1, 3))
pad: same
dil: ((1, 1), (1, 10))
strides: ((1, 1), (1, 1))
mpool: ((1, 6), (1, 5))
depth_mul: (3, 2)
drp: 0.5
dense_drp: True
dense: (500, 100, 100, 20)
b_norm: True
